---
type: GeometryElement
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# GeometryElement

`Autodesk.Revit.DB.GeometryElement` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetBoundingBox | 2013 | `public BoundingBoxXYZ GetBoundingBox ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator < GeometryObject > GetEnumerator ()` |
| Method | GetEnumeratorNG | — | `internal IEnumerator GetEnumeratorNG ()` |
| Method | GetTransformed | — | `public GeometryElement GetTransformed ( Transform transform )` |
| Property | MaterialElement | — | `public Material MaterialElement { get ; }` |